app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "avatar_file_name", "avatar_file_size", "updated_at", "crypted_password", "remember_token_expires_at", "avatar_content_type", "remember_token", "avatar_update_at", "login", "email", "created_at") VALUES(NULL, '70e28771918448382b9747398ff2eeaa75fc606f', NULL, NULL, '2009-04-15 18:03:23', '691db5245f06f4f54e68d027e9c0a37128d707c9', NULL, NULL, NULL, NULL, 'quire', 'quire@example.com', '2009-04-15 18:03:23')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save